# GetExternallyTaggedReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..GetExternallyTaggedReference Method
DirectShapeType Class See Also
---
Retrieve a Reference to reference geometry of the DirectShapeType that is associated with a particular ExternalGeometryId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public Reference GetExternallyTaggedReference(
	ExternalGeometryId externalId
)
```

Visual Basic
---
```text
Public Function GetExternallyTaggedReference ( _
	externalId As ExternalGeometryId _
) As Reference
```

Visual C++
---
```text
public:
Reference^ GetExternallyTaggedReference(
	ExternalGeometryId^ externalId
)
```

# ### Parameters
externalId
    Type: Autodesk.Revit.DB..::..ExternalGeometryId The ExternalGeometryId of the requested reference object.
# ### Return Value
A Reference to the externally tagged reference GeometryObject having the provided external ID or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no reference geometry having the external ID.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace